xxluestc/Phytium/GD32L233C_Prj_Master_v3/GD32L233C_Prj_Master/FreeRTOS/config/FreeRTOSConfig.h
/*
 * FreeRTOS V202112.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

/******************************************************************************
	See http://www.freertos.org/a00110.html for an explanation of the
	definitions contained in this file.
******************************************************************************/

#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
 * FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE.
 * http://www.freertos.org/a00110.html
 *----------------------------------------------------------*/
#include "gd32l23x.h"

//#define cmsgs_device_header "gd32l23x.h"          /* CMSIS RTOS v2 封装层需要 */

extern uint32_t SystemCoreClock;

#define configOVERRIDE_DEFAULT_TICK_CONFIGURATION 1

/* Cortex M23 port configuration. */
#define configENABLE_MPU										0	// 禁用MPU (内存保护单元)
#define configENABLE_FPU										0	// 禁用FPU (浮点单元)
#define configENABLE_TRUSTZONE							0 // 禁用TrustZone安全扩展

/* 调度器行为配置*/
#define configUSE_PORT_OPTIMISED_TASK_SELECTION			0	// 禁用硬件优化任务选择
#define configUSE_PREEMPTION												1 // 启用抢占式调度
#define configUSE_TIME_SLICING											1 // 启用时间片轮转
#define configMAX_PRIORITIES											( 6 ) // CMSIS RTOS v2要求56
#define configIDLE_SHOULD_YIELD											1 // IDLE任务让出CPU
#define configUSE_16_BIT_TICKS											0 /* Only for 8 and 16-bit hardware. */ // 不使用16位Tick计数

/* Constants that describe the hardware and memory usage. */
#define configCPU_CLOCK_HZ								SystemCoreClock // CPU时钟频率
#define configMINIMAL_STACK_SIZE					( ( uint16_t ) 128 )	// 最小栈大小(字)
#define configMINIMAL_SECURE_STACK_SIZE		( 1024 )	// 安全模式最小栈大小
#define configMAX_TASK_NAME_LEN						( 12 )	// 任务名最大长度
#define configTOTAL_HEAP_SIZE							( ( size_t ) ( 12 * 1024 ) )	// 总堆大小10KB

/* Constants that build features in or out. */
#define configUSE_MUTEXES										1	// 启用互斥锁
#define configUSE_TICKLESS_IDLE							1 // 启用低功耗tickless空闲模式
#define configUSE_APPLICATION_TASK_TAG			0 // 禁用任务标签功能
#define configUSE_NEWLIB_REENTRANT					0 // 禁用newlib重入支持
#define configUSE_CO_ROUTINES								0	// 禁用协程
#define configUSE_COUNTING_SEMAPHORES				1	// 启用计数信号量
#define configUSE_RECURSIVE_MUTEXES					1 // 启用递归互斥锁
#define configUSE_QUEUE_SETS								0 // 禁用队列集
#define configUSE_TASK_NOTIFICATIONS				1 // 启用任务通知
#define configUSE_TRACE_FACILITY						1 // 启用跟踪功能

/* Constants that define which hook (callback) functions should be used. */
#define configUSE_IDLE_HOOK									0 // 启用空闲任务钩子
#define configUSE_TICK_HOOK									1 // 启用Tick钩子 (用于led_spark/delay_decrement)
#define configUSE_MALLOC_FAILED_HOOK				0 // 禁用内存分配失败钩子

/* Constants provided for debugging and optimisation assistance. */
#define configCHECK_FOR_STACK_OVERFLOW					0 // CMSIS v2兼容: 类型冲突暂时关闭
#define configASSERT( x )												if( ( x ) == 0 ) { taskDISABLE_INTERRUPTS(); for( ;; ); }
#define configQUEUE_REGISTRY_SIZE								0 // 队列注册表大小

/* Software timer definitions. */
#define configUSE_TIMERS											1 // 启用软件定时器
#define configTIMER_TASK_PRIORITY						( 3 ) // 定时器任务优先级
#define configTIMER_QUEUE_LENGTH							5 // 定时器命令队列长度
#define configTIMER_TASK_STACK_DEPTH				( configMINIMAL_STACK_SIZE  ) // 定时器任务栈深度

/* Set the following definitions to 1 to include the API function, or zero
 * to exclude the API function.  NOTE:  Setting an INCLUDE_ parameter to 0 is
 * only necessary if the linker does not automatically remove functions that are
 * not referenced anyway. */
#define INCLUDE_vTaskPrioritySet                 1    // 包含设置任务优先级
#define INCLUDE_uxTaskPriorityGet                1    // 包含获取任务优先级
#define INCLUDE_vTaskDelete                      1    // 包含删除任务
#define INCLUDE_vTaskCleanUpResources            0    // 不包含清理任务资源
#define INCLUDE_vTaskSuspend                     1    // 包含挂起任务
#define INCLUDE_vTaskDelayUntil                  1    // 包含绝对延时
#define INCLUDE_vTaskDelay                       1    // 包含相对延时
#define INCLUDE_uxTaskGetStackHighWaterMark      0    /* CMSIS RTOS v2要求 */
#define INCLUDE_xTaskGetIdleTaskHandle           1
#define INCLUDE_eTaskGetState                    1
#define INCLUDE_xTaskResumeFromISR               0
#define INCLUDE_xTaskGetCurrentTaskHandle        1
#define INCLUDE_xTaskGetSchedulerState           0    /* CMSIS RTOS v2要求 */
#define INCLUDE_xSemaphoreGetMutexHolder         0    /* CMSIS RTOS v2要求 */
#define INCLUDE_xTimerPendFunctionCall           1    // 包含 timers.h 中的xTimerPendFunctionCall

/* This demo makes use of one or more example stats formatting functions.  These
 * format the raw data provided by the uxTaskGetSystemState() function in to
 * human readable ASCII form.  See the notes in the implementation of vTaskList()
 * within FreeRTOS/Source/tasks.c for limitations. */
#define configUSE_STATS_FORMATTING_FUNCTIONS			1 // 启用统计格式化函数

/* Dimensions a buffer that can be used by the FreeRTOS+CLI command interpreter.
 * See the FreeRTOS+CLI documentation for more information:
 * http://www.FreeRTOS.org/FreeRTOS-Plus/FreeRTOS_Plus_CLI/ */
#define configCOMMAND_INT_MAX_OUTPUT_SIZE				2048 // CLI命令最大输出大小

/* Interrupt priority configuration follows...................... */

/* Use the system definition, if there is one. */
#ifdef __NVIC_PRIO_BITS
	#define configPRIO_BITS								__NVIC_PRIO_BITS // 8个优先级等级
#else
	#define configPRIO_BITS								3	 /* 8 priority levels. */
#endif

/* The lowest interrupt priority that can be used in a call to a "set priority"
 * function. */
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY			0x07 // 最低中断优先级

/* The highest interrupt priority that can be used by any interrupt service
 * routine that makes calls to interrupt safe FreeRTOS API functions.  DO NOT
 * CALL INTERRUPT SAFE FREERTOS API FUNCTIONS FROM ANY INTERRUPT THAT HAS A
 * HIGHER PRIORITY THAN THIS! (higher priorities are lower numeric values). */
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY	2 // 最大SysCall中断优先级

/* Interrupt priorities used by the kernel port layer itself.  These are generic
 * to all Cortex-M ports, and do not rely on any particular library functions. */
#define configKERNEL_INTERRUPT_PRIORITY					( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << ( 8 - configPRIO_BITS ) )

/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
 * See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY			( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << ( 8 - configPRIO_BITS ) )

/* The #ifdef guards against the file being included from IAR assembly files. */
#ifndef __IASMARM__

	/* Constants related to the generation of run time stats. */
	#define configGENERATE_RUN_TIME_STATS				0
	#define portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() 
	#define portGET_RUN_TIME_COUNTER_VALUE()			0 // 禁用运行时间统计
	#define configTICK_RATE_HZ							( ( TickType_t ) 1000 ) // Tick频率1kHz

#endif /* __IASMARM__ */

/* Enable static allocation. */
#define configSUPPORT_STATIC_ALLOCATION					0 // 禁用静态分配

#endif /* FREERTOS_CONFIG_H */
